{
  "trans": [
    "I travel me to the the compensation.",
    "The writer of this him was a sister little known to the world or Christianity, but who at the beginning of the 20th century occupied a Paramount place in the Lord's move in China?",
    "It was through her that Watchman Nee a seer of the divine revelation in the present age was introduced to the way of life.",
    " In the next 30 minutes, we want to look at the life and time of this marvelous yet hidden vessel of God whose hymns and life have touched thousands of lives and have become an encouragement to Generations afterwards Margaret. Emma Barber was born in 1866 in peasant Hall in County Suffolk in the south of England the daughter of Louis and",
    " The barber according to the records of the family records Center her father was a wheel right one who repairs wheels and as such she would have been raised in a rather humble environment in 1890 when she was 24 a call was made in Faraway China by Hudson Taylor at the conference of protestant missionaries of China.",
    " We do now appeal to you the Protestant churches of Christian lands the center China in response to these calls 1,000 men within five years from this time. We make this appeal in behalf of 300 Millions upon evangelized Heathen. We make it with all the earnestness of our whole Hearts as men overwhelm with a magnitude and responsibilities of the work before.",
    " With in exactly five years of such a call in 1895 Emmy Barber set sail for China under the direction and with the support of the church missionary Society of London by February of the following year. She arrived in Hong Kong and in March in fuchao.",
    " Dear, mr. Barring gold. It was lovely to rest on our fathers words. He shall cover thee as we stepped for the first time upon this soil and realize perhaps as never before the honor. God had put upon us.",
    " It was one of the happiest days of my life when I really landed in China Margaret ibaba, March 6 1896 soon after arriving. She was assigned to the Village of konkow together with two other lady missionaries and she immediately immersed herself in the needs around her.",
    " Because of the poor condition of her dwelling she was asked to move back to the city Tim is devouring gold. I'm extremely sorry to hear from mr. Lloyd that there is a probability that we may get orders from England to leave our station and go to fuchao. I am writing to ask you to allow us to remain here. When dr. Taylor was here. Our house was being sealed since this work has been done. The difference has been wonderful before the house was sealed the strong winds which are soaked.",
    " Old and searching on the Seacoast comes sweeping up through the cracks in the board's we could never get warm anywhere the malaria if there is any will also now be prevented from rising the work here is glorious more and more and there is plenty for us all three to do with kind regard. I Am Yours Faithfully Margaret a barber March 16th 1898",
    " Full Chow at the turn of the century was a bustling City it lies on both sides of the men River at the Estuary to the north of the river was the old city proper to the South a community of more recent development mainly spurred by the settlement of foreigners and Christian missions.",
    " In the middle of the river and Island and spanning the river Was An Old Bridge the Thousand-Year Bridge built of huge chunks of ancient rocks here Miss Barbara was assigned to teach at the Town Sue girls high school for seven years. Woo Me O Lord from Easy paths whose flowers I gather as I go.",
    " That I a deeper fellowship with thee May daily hourly. No.",
    " Speak to me Lord, but as I climb the steeper Heights, my soul may hear thy voice which never fails to nerve my heart and drive away my fear and if dear Lord the flesh would Fain forsake the heights forgo the prize.",
    " Fasten On Me by Look of Love and make me meet by searching eyes.",
    " Thus woo me speak to me and be the light to lead me on and on until those glorious Heights are gained where thou o Christ Our Holy One.",
    " Because of the rich Life of Christ overflowing in her excellent living many students were attracted and desired Miss Barbara's instruction. This made the principal jealous of her the principal accused her of ten illegal matters while she was being carefully examined. She had a feeling before the Lord if the thumb argues with the little finger it only hurts the head so I should just leave this school.",
    " She was completely obedient to Christ and quietly left the school even so a list of her crimes was sent to the parent Committee of the British Mission during that time. She was learning to remain silent under the shadow of the Cross preferring rather to suffer misunderstanding than defend herself. She said nothing in answer to the false charges. She returned to England and continued her silence offering no vindication.",
    " One of her fellow missionaries, however, eventually related the truth of the situation to the director responsible for the mission realizing that she had placed herself under the authority of the Cross. He finally told her",
    " As your Authority I charge you to tell me the facts of what happened in China. Don't hide anything.",
    " Submitting herself to God's delegated authority. She finally told him the truth of what had happened in her case was cleared.",
    " Around this time. She met brother DM Panton the editor of the Christian magazine called the dawn. She received much help and light from Panton. He was clear about the matter of division. He also knew the Prophecies of the Bible and the truths concerning overcoming he influenced her to live as a person waiting for the Lord's return.",
    " During the two years that she remained in England. She exercised faith and prayed that the Lord would open the way for her to go back to work in China.",
    " Finally in 1909 with Fellowship from DM Panton and the Surrey Chapel of Norwich where he ministered she returned to China this time. There was no big mission to support her she would go and she would live by faith.",
    " Her niece a Miss Ballard who was 20 years her Junior accompanied her to China Miss Ballard had her own small savings, but Emmy Barber had only the Lord of Psalm 23 as her Supply while the ship crossed the Min river in China. She quietly look to the Lord independent for her needs and her future.",
    " About an hour's boat ride from fuchao farther down the mid-river lay the little Port of pagoda Anchorage where the water is deeper and larger ocean vessels take anchor The Landmark low Sheen Pagoda. Is there across the bay from this Harbor was a little village known as by otacon here Emmy Barber chose to make her new home from here. She could catch a lovely view of the Moon River and the Pagoda Anchorage across the bay.",
    " This is the spot where me Barbara's house was situated in this clearing once stood a row of ten. Wooden houses.",
    " The landlord was a sister sister Shaw, who was the principal of an orphanage? This one is for Emmy Barber her Promised Land. It was here that she pitched a tent and built an altar for the next 20 years one year the landlord decided that she needed the houses for the orphanage. She asked Miss Barbara to move and she sent Workman to make repairs on the houses.",
    " However, Miss Barber continue to trust God that he would not go against what he had promised with confidence. She prayed. Oh Father I beg you to make your promise firm in the end the landlord sent someone to tell her that the repaired houses were hers to live in she resided there until her departure be with the Lord in 1930.",
    " In the church assembly hall and biotin. We met a man whose father served as Miss Barbara's cook during her stay in the village.",
    " Sister Barbara came here to preach the gospel in 1911. She traveled to the neighboring villages to see if anyone would believe in the Lord. No one then new name of Jesus and she began to preach the gospel my father and my grandmother both moved here and later. He served as her cook at that time. No one was a Believer and she began to preach the gospel in the nearby Villages. She would come to her home in preach while you would be cooking and burning firewood and she would sit.",
    " Down and helping the work while speaking God's word to you slowly bit by bit in such a hidden way Miss Barbara began her Ministry, even though outwardly there was little result of her work inwardly. She was breathing in the Heavenly are and gaining deeper fellowship with the resurrected Christ one of her hymns expressed such a deep experience of the Lord and in particular in his precious name.",
    " Hers was not the ministry of power and great outward achievement. But rather of a life lived within the veil through the cross in the heavenlies once someone asked her, what are the requirements to work for the Lord she replied?",
    " The requirement to work for the Lord is not to work.",
    " Some of the Chinese young people who received help from her were worried about her. They wondered why doesn't she go out and establish meetings and work in a bigger city. It seemed that it was a waste for her to live in a small village where nothing outwardly was happening, but did not marry do the same when she poured out the precious ointment on her beloved Lord the Lord charge that such a net which fragrance filled the house should be told of wherever the gospel is proclaimed.",
    " and in the whole world",
    " footnote one for Matthew chapter 26 verse 8 in the recovery version of the New Testament says throughout the past twenty centuries thousands of precious lives heart Treasures High positions and golden Futures have been wasted upon the Lord Jesus to those who love him in such a way. He is altogether lovely and worthy of their offering.",
    " What they have poured upon Him is not a waste but a fragrant testimony of his sweetness.",
    " We're too weak sisters the thought of evangelizing the vast land of China seemed but a distant dream, but they soon realized that God would raise up young people from among the Chinese population for his own sake for this they were willing to bury themselves as seeds in the ministry of prayer for 10 long years. God finally answered their prayers during the tenth year of their seemingly fruitless Labour a Revival broke out in fuchao among those",
    " Raised up at that time. We're Leland Wang KH way faithful Luke Wilson Wong and many other young brothers and sisters. These would frequently go to Miss Barbara to receive training and spiritual instruction to meet the many spiritual needs Miss Barbara prepared a group of houses around her residence for the purpose of hospitality. She would conduct training classes in some of these houses, but it was the private fellowship and long",
    " Channel talks that became the greatest edification in perfecting for one particular young Seeker named Watchman Nee",
    " Whenever he had a problem or needed spiritual instruction or strengthening he would go to Emmy Barber. She treated him as a young learner and frequently administered strict discipline.",
    " We had a co-worker's meeting every Friday in which the other five were forced to listen to the arguing between the two of us after having a dispute on Friday. I would go to Sister Barber on Saturday and accuse the other co-worker.",
    " Whether that co-worker is wrong or not is another matter while you are accusing your brother before me. Are you like one who is bearing the cross? Are you like a lamb?",
    " When she questioned me in this way, I felt very ashamed and I could never forget it my speech and my attitude that day revealed that I was indeed not like one bearing the cross not like the lamb.",
    " Everything about Miss Barber or a touch of the Lord's presence Watchman Nee often told of a time when he went to visit her in her home.",
    " Even while waiting for her in her living room. He had a deep sense of the Lord's presence.",
    " In one of her papers, she had written. I want nothing for myself. I want everything for the Lord. This was her prayer to the Lord later Watchman Nee adopted this impressive prayer as his motto.",
    " Day by day Miss Barbara anticipated the Lord's return on the last day of 1925 as she and Watchman Nee were praying together. She prayed Lord. Will you really let the year 1925 pass away?",
    " Although it is the last day of the year. I still ask you Lord to come today.",
    " Sometime later as the two of them walk together. They neared a corner. She said perhaps as we turn the corner we will meet him.",
    " To her the Lord's return was not a Doctrine but a Living Hope which governed her work and living.",
    " Quietly in the remote Village of biotin a different kind of missionary and Pioneer was slowly charting the course of another field the field of life and Resurrection in the Divine and mystical realm the daily beautiful Vista of these little boats along the mid-river would likely have given her the inspiration to write about the even more beautiful and Serene life of Faith, which she now possessed.",
    " a him like milk and honey is the outflow of a life that has learned lessons and is dealt with",
    " this cannot happen in one day and one night.",
    " After living a hidden life and that remote corner of the world for 20 years at the end of February 1930. She contracted enteritis a disease of the intestines today commonly known as Crohn's disease.",
    " Within a short time she concluded her 63 years of Earthly pilgrimage.",
    " It is said that before she departed. She was shouting life life in a package of personal belongings, which was given to Watchman Nee upon her death was a note which said",
    " Dear Lord, I thank you because you have a commandment saying you shall love the Lord your God with all your heart and with all your soul and with all your mind. She was buried in the village of by gotten on her gravestone were engraved the words the resting place of Miss. Emmy Barber met a double portion of her spirit. Be upon us.",
    " Today visitors cannot readily find her grave site. We were fortunate enough to meet Mr. Wong who talked about her burial site.",
    " She was buried back in the Hills up there that is a place for foreigners apart for foreigners to be buried there were two or three dozen people buried there. There were all foreigners from fuchao some who lived in future were also buried there. We called it the cemetery for Shantae the nickname for foreigners Mr. Wong led us to her grave. We walked and walked up the hill on an unpaved dirt road. Finally we turned and came to a grassy.",
    " Deserted Knoll halfway up the lane. This is the place where Miss Emmy Barber was buried.",
    " They were not covered up originally. They were people guarding the grapes there was even wall at one time with custodians. But after the Communists came the custodians were gone by 1960. We're having a famine and no one was fed. Well, the graves were destroyed in the pot was converted into a potato field.",
    " Here with a panoramic view of the land and the country that she loved and had sacrificed her entire life for Emmy Barber was laid to rest. It was a long journey from the little English Hamlet to The Faraway land of fuchao China. She followed the footsteps of her master and became a drink offering to satisfy the one she loved supremely",
    " through such sacrifice. She also became the channel through which the Lord raised up Watchman Nee one great vessel in the 20th century and through that ushered in the great move of God's economy in this present age."
  ]
}
