{
  "trans": [
    "Although archaeology 11 dense point to China as one of the cradles of human race. There are no written records from before 3,000 BC and the era immediately after hence this period is referred to as legendary It is believed that the yellow Emperor lived during this time and is considered the founder of ancient Chinese civilization.",
    " next game China's Bronze Age under the rule of the sea on Dynasty followed by the Shang Dynasty during which the Oracle bones were inscribed the dough Dynasty in the inh mock both feudalism and the age of sages despite the rise of philosophically thought with thinkers like Confucius and loads of the futile struggle for power eventually led to the Warring States period",
    " Division empowering keep the Ching Sting the advantage to conquer all the other states and to subsequently become the first ruling dynasty of Imperial China the reign of King. However, did not survive very long after Ching sure ones death he gave way in 206 BC to the Western Han Dynasty the short-lived Shang Dynasty. And then the Eastern Han Dynasty the Han dynasties for century-long rule is",
    " You got it as the golden age in Chinese history great advancements were made in areas ranging from economics and education to Science and Technology. However, an agrarian crisis and the following peasant rebellion led first to the loss of power of the Hun rulers and then to the romanticize era known as the Three Kingdoms. There was a decline in both population and economy as China witnessed the bloodiest point in its history.",
    " Only recovering a little after a brief reunification during the Jin Dynasty the North and South dynasties brought the appearance of the Chinese Pagoda alongside the spread of Buddhism while the sui Dynasty built the Grand Canal which Remains the longest in the world today.",
    " Art and literature Blossom during the Golden Age of the Tang Dynasty and continue to flourish after the five dynasties from the song to The Yuan Dynasty Mongolian rule collapse in 1368 and made way for the Ming Dynasty which saw the building of structures like the Imperial Palace and the Temple of Heaven in Beijing the last Dynasty of Ching founded by a Manchurian Clan faced numerous rebellions lead.",
    " Do emperor puyi he's application? Dr. Sun Yat-sen, then established a Republic of China when civil war broke out the Communist Party give you that the calming down and started its role under the flag of the People's Republic of China and the leadership of mounted on the introduction of opium during the Qing Dynasty and the consequent Wars had left China in a vulnerable state this alongside political and civil.",
    " rest resulted in waves of emigration from the 19th century to 1949",
    " A massive amount of bones with inscriptions have since been Unearthed providing insight to ancient Chinese writing.",
    " Here are some examples of how Chinese words have evolved through pictures.",
    " The Chinese character for son derived from a circle and changed what it looks like now.",
    " The word mountain is a simplified picture of three mountains that evolve into three Strokes.",
    " The word elephant began with a picture of an elephant which found its way to its present form.",
    " The word rain came from an image that looked like water drops falling from above and overtime transform into how it is written today.",
    " Understanding how words were formed in Chinese script give further insight into the ancestral roots of the people. This is illustrated by setting it against the backdrop of the Bible an ancient book written by the Jews 3,000 years ago.",
    " The Jewish people lived in the Middle East with no external contact outside that region until the 17th century this meant that the Chinese and the Jews would have no knowledge of each other prior to that time yet writings and records of both cultures point to a similar history.",
    " First the question about the origin of man, where did man come from chuang Tzu the tau is thinker rights in the beginning of all things. There was a void there was nothing that could be named similarly the Bible starts with Moses writing the account of how in the beginning the Earth was without form and void Dong Dong shoe an out-of-town always think her rights. This origin is like the sauce its significance.",
    " And it's permeation of Heaven and the Earth from the beginning to the end parallel to this is the Jewish prophets John's writing about God as the origin and a source of matter and time. I am the Alpha and the Omega I am the beginning and the end.",
    " Starting from the writings of Moses and Genesis. The history of mankind can be followed by setting Chinese characters and the biblical account side by side.",
    " The Bible reads and the Lord God formed man of the Dust of the ground and breathed into his nostrils the breath of life and Man became a living being the Chinese word to create is formed by the word speak dust life and walk as God spoke to the dust to dust receive the life and was able to walk then he placed the first person Adam into the garden and blessed him.",
    " In Genesis, it says the Lord God planted a garden Eastward in Eden and there he put the man whom he had formed. But Adam was lonely. So God formed woman out of one of Adam's ribs and called her Eve in the garden. There were two special trees the tree of life and the tree of the knowledge of Good and Evil God forbade Adam and Eve to eat of the tree of the knowledge of Good and Evil and warned of the death if they did.",
    " I obeyed we see this in the ancient Chinese word for restraint which is made up of a mouth and a tree. However, the devil disguised himself as a snake and tempted Eve. He persuaded her to think that she would not die if she ate the fruit and that her eyes would be open to see the things the way God did knowing both good and evil Eve then started to covet the trees fruit.",
    " The Chinese word for covet desire or greed is formed with two trees and a woman when Eve ate the fruit and gave it to Adam this brought death to them as written in the Bible. They could no longer Live Forever In God's Presence the word for put to death comprises of his words, which warned them that if they partook of the Forbidden tree their life will return to dust from which they were taken.",
    " According to the Bible Adam and Eve were driven out of the garden of the day had sinned and began to multiply the Earth evil increased with Mankind and God decided that they needed to be destroyed one man. However found favor in God's eyes and was spared before God struck the Earth with a great flood. He instructed Noah to build an ark large enough to shelter a pair of each living creature as well as his family of eight himself.",
    " His wife his three sons and three daughters in law. The Chinese word for boat comprises of the word vessel with eight mouths in it symbolizing eight people the word flood is made from the words eight United and Earth forming the word total and water after the flood Noah set up an altar and offered burnt offerings to God for thousands of years during the New Year. The Chinese have also set up.",
    " An altar with burnt offerings to the god of Heaven this practice is still very much alive today.",
    " Once the flood receded people began populating the Earth and after a period of time, they gathered at The Plains of shinar and began building a tower to reach the heavens at that time. Everyone. Spoke just one language.",
    " The word tower in Chinese is made up of the words grass clay one mouth and Mankind this agrees with the Bible when it says now the whole earth had one language and one speech and it came to pass as they journeyed from the East that they found a plain in the land of shinar and they dwelt there then they say it to one another come that is make bricks and bake them thoroughly. They had brick for stone and had asphalt for more top.",
    " And they said come let us build ourselves a city and a tower whose top is in the heavens that is make a name for ourselves lest. We be scattered abroad over the face of the whole earth. God was against what they were doing and came down to confuse their language. There was then a great division of languages followed by the mass migration of mankind to different parts of the Earth the Chinese character for my great consisting of the words great.",
    " in West and walk and capsule eights what happened and indicates where the Chinese went from the great division in the west they walked",
    " In the meantime a man by the name of Abraham living in the Middle East was called by God's leave his family in the place called Earth God commanded Abraham to go to the land where he would show to him and promised that he would be a great nation Genesis chapter 12 verses 1 through 3. Now, the Lord had said to Abram get out of your country from your family and from your father's house to a land that I will show you. I will make you a great nation.",
    " I will bless you and make your name great and you shall be a blessing. I will bless those who bless you and I will curse him who curses you and in you all the families of the Earth shall be blessed. It was a promise to Abraham that through him and the generations after him. He would bring the blessings of eternal life back to mankind. The nation of Israel was a result of the ancient promised by God to One Man 42 Generations after Abraham.",
    " Am Jesus was born.",
    " Jesus was the son of God who was sent 2,000 years ago to bring Redemption to the whole world. Jesus lived for only 33 years, but during the last three years of his life. He healed the sick gave sight to the blind cast out demons and even raised the dead Jesus taught his disciples of other kingdom of God and about clouds live rightly. He commanded them to teach and tell the world about the good news of redemption. He was eventually",
    " made by the people for teaching the truth about God, but on the third day after he died he rose from the dead as proof of his deity. And as an act of redemption of our souls, he then gave Specific Instructions to his disciples to spread this good news that Jesus became the sacrificial lamb that was slain and the offering of his innocent blood to God would pay for our sins. The Chinese word for sacrificial animal is formed with the word ox and lamb",
    " Mind with the word sword and I'm blemish this reflects a sacrifice to God by the Chinese as well. As Jesus as the sacrificial lamb that was sinless and unblemished. The next word righteousness is even more intriguing a lamb above the word me which is made up of hand and spear speaks of how Jesus the righteousness of God who became the sacrificial lamb for us was pierced for our transgressions.",
    " Just as Sin was brought into the World by a fallen man. Redemption was brought into the World by a righteous one. And now that Redemption is being offered to all Chinese through the acceptance of Jesus as the one who was sent by shundi the god of Heaven to reconcile us back to him."
  ]
}
