{
  "trans": [
    "From the specimens that Darwin obtained in the Galapagos.",
      "He actually handed these things",
      "and how do you explain this",
      "and in his notes actually,",
      "he came up with this diagram here a tree and",
      "he actually said I think so.",
      "He was talking about different species",
      "and maybe maybe those species came from some common ancestor.",
      "Actually when it comes to finches we actually would agree.",
      "It's creationists that different fish species came from a common ancestor, but a finch",
      " CH is what they would have to come from which",
      "see Darwin wasn't just thinking about species",
      "Darwin had a much bigger picture in mind",
      "when you look at the Origin of Species",
      "and and read that book you'll find he made this statement",
      "from such a low and intermediate form both animals and",
      "plants may have been developed.",
      "And if we admit this we must likewise admit that",
      "all organic beans which have ever lived on this Earth",
      "may be descended from some one primordial form.",
      "So he had in mind what we",
      " Today know as an evolutionary tree of life that",
      "all life has arisen from some primordial form.",
      "Now, when you consider the classification system",
      "kingdom phylum class order family genus species,",
      "we would say as creationists and",
      "we have many creation scientists have researched this",
      "and for lots of reasons,",
      "I would say the kind in Genesis 1 really is",
      "more at the family level of classification",
      "for instance is one dog kind and",
      "you see based on the biblical account there in Genesis.",
      " This one creationists have drawn up.",
      "What they believe is a creation Orchard.",
      "In other words, they're saying",
      "look there's great variation in the genetics of dogs",
      "and Fincher's and so on and so over time",
      "particularly after Noah's flood you'd expect",
      "if there were two dogs for instance you could end up with different species of dogs",
      "as because there's an incredible amount of variability in the genes of any creature and",
      "so you'd expect these different species up here,",
      "but there's limits dogs will always be dogs finches will always be finches.",
      " For instance take dogs.",
      "Okay in a scientific paper dated January 2014",
      "scientists working at the University of California stated this",
      "we provide several lines of evidence supporting a single origin for dogs and",
      "disfavoring alternative models in which",
      "dog lineages arise separately from geographically distinct wolf populations,",
      "and they put this diagram in the paper.",
      "By the way. That diagram is very very similar to this diagram that creationists.",
      " Pose based upon the creation account in Genesis.",
      "In other words, you have a common dog ancestor to gives rise to the different species of dogs.",
      "And that's exactly what we're saying here.",
      "The word Evolution has been hijacked using what I call a bait and switch.",
      "Let me explain to you the word evolution is being used in public school textbooks and",
      "we often see it and documentaries and so on",
      "it's used for observable changes that",
      "we would agree with and then use for unobservable changes such as molecules to man.",
      " See students are taught today.",
      "Look there's all these different animals plants,",
      "but they're all part of this great big tree of life",
      "that goes back to some primordial form",
      "and look we see changes changes in Ventures changes in dogs and so on",
      "now, we don't deny the changes.",
      "You see that you see different species of finches different species of dogs,",
      "but then they put it all together in this evolutionary tree,",
      "but that's what you don't observe.",
      "You don't observe that that's belief there.",
      "That's their historical science that I would say was wrong."
  ]
}
