{
  "trans": [
    "We are all well aware of the suffering and",
    "evil in the world.",
    "Horrific suffering",
    "unspeakable evil",
    "how then can anyone believe in the existence of an all-loving all-powerful God",
    "and if God does exist,",
    "why would anyone want to worship Him?",
    "Epicurus framed The Logical problem of suffering and",
    "evil like this",
    "if God is willing to prevent evil but",
    "not able then he's not all-powerful",
    "if he is able to prevent evil but",
    "not willing he is not good.",
    "But if he is both willing and able",
    "how can evil exists",
    "and if he is neither able nor willing then why call him God in other words. It's",
    "Equally impossible for God and",
    "suffering to both exist,",
    "but we know full well that suffering exists.",
    "Therefore. God does not.",
    "Is this a good argument? Let's look at it more closely",
    "are these two statements logically inconsistent know",
    "here is an example of two logical inconsistent statements David can't be both married and a bachelor",
    "but there is no explicit contradiction between these two statements.",
    "So there must be hidden assumptions behind this argument that would bring out the alleged contradiction here. They are.",
    "If God is all powerful he can create any world he wants and",
    "if God is all loving",
    "he prefers the world without suffering.",
    "So if an all-powerful all-loving God exists,",
    "it follows that suffering does not exist",
    "since suffering obviously does exist The Atheist concludes that God must not exist,",
    "but are the atheists to Hidden assumptions necessarily true",
    "consider the first assumption.",
    "Can God create",
    "Eight any world he wants what if he wants a world populated by people who have free will",
    "it's logically impossible for God to force someone to freely choose to do good",
    "posting free choices is like making a square circle.",
    "It's not logically possible.",
    "It's not that God lacks the power to perform the task",
    "is that the supposed task itself is just nonsense,",
    "so it may not be feasible.",
    "To create a world populated by people who always freely choose to do what is morally good.",
    "So the first assumption is not necessarily true therefore the argument fails. And what about the second assumption?",
    "Is it necessarily true that God would prefer a world without suffering.",
    "How could we possibly know this",
    "we all know of cases where we permit suffering in order to bring about a greater good",
    "if it's even possible that God.",
    "Those suffering in order to achieve a greater good then we cannot say this assumption is necessarily true.",
    "For The Logical problem of suffering to succeed",
    "The Atheist would have to show that it's logically impossible that Free Will exists",
    "and that it's logically impossible that God has good reasons for permitting suffering",
    "this burden of proof is too heavy to bear.",
    "It's quite possible that God and",
    "suffering both exist.",
    "This is why philosophers even if he is philosophers have given up on The Logical problem of evil.",
    "Ville",
    "we can concede that the problem of evil does not after all",
    "show that the central doctrines of theism are logically inconsistent with one another",
    "some philosophers have contended that the existence of evil is logically inconsistent with the existence of a theistic God.",
    "No one I think has succeeded in establishing such an extravagant claim",
    "It's no knowledge on almost all sides that The Logical argument is bankrupt.",
    "But this is hardly the end of the discussion.",
    "We still need to explore the probability version of the problem of evil."
  ]
}
