{
  "trans": [
    "How many mutations does it take to change a pakicetus to whale hmm not where I would have gone with a job but what do I know to put that in context take drafts and their Derpy Little short-necked Pals the Okapi they're quite similar in a recent paper studied their differences in found surprisingly 70 different genes that likely contributed to the drafts appearance if animals that similar required 70 Gene changes for basically just a longer neck and stronger heart.",
    "It's a",
    " a pretty safe bet that animals as different as pakicetus and Wales would require at least as many and more likely many thousands more but it gets worse recently a new bacillus ordered fossil was found in Antarctica that even using the most generous dates for darwinist see cuts down the time available for the will transition to about half of the already not enough time of 8 million years and could even Place fully aquatic whales before rodhocetus before ambulocetus in contemporary with or",
    " Before pakicetus destroying the entire fossil timeline.",
    "So is a whale transitional fossil series any good. Well, once you take into account the padding of their numbers the chronological inversions that ghost lineages more recent fossil finds that discredit the timeline and their creative use of definitions for what it even means to be a transitional fossil the mathematical problems using their own numbers. They're all very clever tricks. But once you see how all of this works, it's quite a bit less impressive to be fair.",
    " Our scientists aren't doing this malicious.",
    "They really believe that evolution is just obviously true. So they reason whether we have eight million years or four million years lots of fossils or no fossils If evolution is true and we have whales today then they must have been able to evolve regardless of any problems that pop up but if you don't presuppose Evolution, if you treat it as a hypothesis rather than an assumption then problems like these become far more difficult to hand wave away. So these false",
    " Find certainly are interesting and worth debating.",
    "But there's a lot more to it than the uncritical glossy one-sided story being told if this is one of the best evidences for evolution, what does that mean for their other evidence? That's not as good. Hmm."
  ]
}
