{
    "trans": [
	"I'm a synthetic organic chemist",
	"origin of life is purely synthetic organic chemistry.",
	"There's no way around it.",
	"I'm perfectly situated to be commenting on",
	"this to be critiquing the origin of Life research.",
	"It is a biological it is before biology takes over.",
	"This is purely synthetic organic chemistry.",
	"Some people argue that",
	"since there's been hundreds of millions of years of vailable",
	"the probability that there's the chance that",
	"these things could happen in hundreds of millions of years,",
	"but that's not true time actually can be an enemy",
	"when it comes to organic synthesis Prebiotic synthesis is before biology.",
	"So one has to make chemicals",
	"many of the chemicals that need to be made for life.",
	"Our kinetic products meaning that",
	"they're not the most thermodynamically stable form for example carbohydrates,",
	"which is the main class of compounds.",
	"This is the these are the the units that hook together DNA.",
	"These are the units that I have identifying aspects on cell structure.",
	"These are the units that the cell is going to need for.",
	"The energy of Life carbohydrates are kinetic products",
	"meaning that if they should form they would decompose.",
	"Decompose over time and relatively short amounts of time.",
	"They decompose the very reactions that ",
	"make them unless somebody is there to pull them out to",
	"fish them out to stop the process and",
	"put them in a bottle under anaerobic conditions",
	"in a freezer and not just one.",
	"There's many many different types you have to do this",
	"they end up going through a process of",
	"what's referred to as caramelization.",
	"Meaning that they polymerize they polymerize the very real",
	" All reactions that were used to make them just continue",
	"and you get poly Aldo's you get poly condensation reactions and",
	"they caramelize or they undergo with formaldehyde",
	"which is a presumed Prebiotic chemical.",
	"They undergo rapid cannizzaro reactions.",
	"So the aldehyde is oxidized to formic acid and",
	"this nice carbohydrate that you made has just been reduced.",
	"So the so the aldehyde the from the carbohydrate is gone back to an alcohol.",
	"So there's competing reactions.",
	" Shins so time does not solve the issue.",
	"The other problem is if you had 400 million years",
	"to get to a certain point in",
	"a synthesis of a particular class of compounds now,",
	"you run out of material.",
	" Anytime you do synthesis, you run out of material,",
	"even when you've optimized deals and",
	"you got to go back to the beginning.",
	"Well say it took you four hundred million years",
	"to get to a certain point on a synthesis.",
	"Now, you have to go back and make more",
	"but how do you go back and make more",
	"because nature never kept a laboratory.",
	"Notebook never doesn't doesn't know",
	"how to go back never kept the record.",
	"So even if it could make more",
	"it doesn't know how to",
	"so it's got to start all over again",
	"some but it doesn't know how to start over again.",
	" When doesn't know why they start over again",
	"because it's doesn't know what it's going toward."
  ]
}
