
{"trans": [ 
    "From the specimens that Darwin obtained in the Galapagos.",
    "He actually handed these things",
    "and how do you explain this and",
    "in his notes actually, he came up with this diagram",
    "here a tree he was talking about different species",
    "and maybe maybe those species came from some common ancestor",
    "Darwin had a much bigger picture in mind",
    "when you look at the Origin of Species and and",
    "read that book you'll find he made this statement from such low and",
    "intermediate form both animals and plants may have been",
    " Galloped and if we admit this we must likewise admit that",
    "all organic beans which have ever lived on this Earth",
    "may be descended from some one primordial form.",
    "So he had in mind what we today know as an evolutionary tree of life",
    "that all life has arisen from some primordial form.",
    "Now, when you consider the classification system",
    "kingdom phylum class order family genus species,",
    "we would say as creationists and we have many creation scientists have researched this and",
    " Lots of reasons I would say the kind in Genesis 1",
    "really is more at the family level of classification for instance is one dog kind.",
    "There's one cat kind even though you have different generate different species and",
    "you see based on the biblical account there in Genesis 1",
    "creationists have drawn up what they believe is a creation Orchard.",
    "In other words, they're saying look there's great variation in the genetics of dogs and",
    "Fincher's and so on and so over time",
    "particularly after Noah's flood you'd expect if there were two dogs.",
    " For instance, you could end up with different species of dogs as",
    "because there's an incredible amount of variability in the genes of any creature.",
    "And so you'd expect these different species up here,",
    "but there's limits dogs will always be dogs finches will always be Fincher's",
    "for instance take dogs. ",
    "Okay in a scientific paper dated January 2014",
    "scientists working at the University of California stated this",
    "we provide several lines of evidence supporting a single origin.",
    " For dogs and disfavoring alternative models in which",
    "dog lineages arise separately from geographically distinct wolf populations and",
    "they put this diagram in the paper.",
    "By the way, that diagram is very very similar to this diagram that",
    "creationist proposed based upon the creation account in Genesis. ",
    "In other words. You have a common dog ancestor to gives rise to",
    "the different species of dogs.",
    "And that's exactly what we're saying here yet the dogs.",
    "Well that's never used as an example of evolution. But the finches",
    " Are particularly in the public school textbooks",
    "students are taught are see the changes that are occurring here.",
    "The word Evolution has been hijacked using what I call a bait and switch.",
    "Let me explain to you.",
    "The word evolution is being used in public school textbooks and",
    "we often see it in documentaries and so on",
    "it's used for observable changes that we would agree with",
    "and then use for unobservable changes such as molecules to man.",
    "Let me explain to you what's really going on",
    "because I was a science teacher in the public schools and ceased",
    " Institute today look there's all these different animals plants,",
    "but they're all part of this great big tree of life that",
    "goes back to some primordial form and",
    "look we see changes changes in Ventures changes in dogs and so on",
    "now, we don't deny the changes you see that",
    "you see different species of finches different species of dogs,",
    "but then they put it all together in this evolutionary tree,",
    "but that's what you don't observe.",
    "You don't observe that that's belief there.",
    "That's their historical science that I would say was wrong,",
    "but you know what you do observe you do observe.",
    " Observe different species of dogs different species of finches,",
    "but then there are limits and you don't see one kind changing into another."
]
}
