{
  "trans": [
    "In part 1 We Looked at The Logical version of the problem of suffering and evil this argument attempt to show that since suffering and evil exist.",
    "It is logically impossible for God to exist and we explained why even atheist philosophers admit that this argument fails",
    " But wait, it may still be argued that while it's logically possible that God and suffering.",
    "Both exist is far from likely there's just so much pointless suffering. It seems improbable that God could have good reasons for permitting it. This is the probability version of the problem suffering provides empirical evidence that God's existence is not impossible. Just highly unlikely. Is this a good argument",
    " Consider three points first, we are not in a position to say with any confidence that God probably lacks reasons for allowing the suffering in the world.",
    "The problem is that we're Limited in space and time and in intelligence and insight God on the other hand sees every detail of history from beginning to end and orders it through people's free decisions and actions in order to achieve his purposes God.",
    " Have to allow a great deal of suffering along the way suffering which appears pointless within our limited scope of understanding may be seen to have been justly permitted by God within his wider framework.",
    "Sometimes what we experience makes no sense until we gain a wider perspective and see the big picture designed by the Creator.",
    " Here's the second Point relative to the full scope of the evidence God's existence May.",
    "Well be probable you see probabilities are always relative to background information. For example, if we consider only how much this man ways we would say is highly improbable that he's a world-class athlete, but when we're willing to consider new information that he's a professional sumo wrestler and World Champion we quickly",
    " Is our view in the same way when the atheist claims that God's existence is improbable.",
    "We should ask improbable relative to what background information if we consider only the suffering in the world. Then God's existence may very well appear to be improbable.",
    " But if we're willing to look at the full scope of background information to take into account the powerful Arguments for God's existence.",
    "We may come to a very different conclusion. The third point is Christianity and Tails doctrines that increase the probability of the coexistence of God and suffering consider four of these first. The chief purpose of life is not happiness people often assume that if",
    " God exists his role is to create a comfortable environment for his human pets.",
    " They think the ultimate goal of Our Lives on Earth is happiness.",
    "And therefore God is obligated to keep us happy. However, Christianity presents a radically different view that the purpose of life is to know God this alone brings true lasting fulfillment suffering can bring about a deeper more intimate knowledge of God, even the part of the one who is suffering or those",
    " Found him the whole point of human history is that God having given us Freewill is drawing as many people as he can into his unending Kingdom suffering is one of the ways God can draw people freely to himself.",
    "In fact countries that have endured the most hardship often show the highest growth rates for Christianity.",
    " God Whispers to us in our Pleasures speaks in our consciences but shouts in our pains it is his megaphone to Rouse a deaf world.",
    " Second mankind is in a state of rebellion against God and his purpose terrible.",
    "Human Evils are testimony to man's depravity a consequence of his alienation from God. The Christian isn't surprised that moral evil in the world on the contrary. He expects it the third Doctrine states that God's purpose is not restricted to this life but spills over beyond the grave into eternal life.",
    " This world is just the beginning the entryway to an unimaginable never-ending life beyond death store Paul who wrote much of the New Testament underwent afflictions hardships calamities beatings imprisonments hunger yet.",
    "He wrote We do not lose heart for this slight momentary Affliction is preparing us for an eternal weight of Glory beyond all comparison because",
    " Look not to the things that are seen But to the things that are unseen for the things that are seen are transient, but the things that are unseen are Eternal Paul understood that life on Earth and whatever suffering it holds for each of us is temporary.",
    "Our pain will not endure forever, but our lives with God will Paul was not belittle in the plight of those who suffer horribly in this life indeed he was",
    " None of them, but he saw that those suffering will be overwhelmed Forever by the ocean of joy that God will give to those will freely receive it.",
    " And the fourth Doctrine is this the knowledge of God is an incomparable good knowing god is the ultimate fulfillment of human existence an infinite good.",
    "Thus the person who knows God no matter how much he has suffered can still say God is good to me. So if Christianity is true, it's not at all improbable that suffering and evil should exist.",
    " In summary for all these reasons the probability version of the problem of evil is no more successful than the logical version as a purely intellectual problem.",
    "Then the problem of evil does not disprove God's existence. But even if those intellectual arguments fail the emotional problem of suffering and evil remains very powerful if you have suffered deeply or if you've watched someone",
    " Love go through intense pain.",
    "You may be thinking so what if God exists, why would I want to respond to him or worshipping I feel cold and empty. I want nothing to do with him.",
    " You're not alone.",
    "God knows your name. He knows who you are and what you're going through God promises to be with you through your suffering. He can give you the strength to endure.",
    " Jesus Christ also suffered, although he was innocent.",
    "He was tortured and sentenced to death his suffering had a purpose to provide you and me with a life-giving connection to God not only does God exist, but he loves you. He seeks after you he offers you hope.",
    " And in time you will make all things new he will wipe every tear from their eyes.",
    "There will be no more death or Mourning or crying or pain for the old Order of Things has passed away."
  ]
}
