{
  "trans": [
      "And the one hand academic work and research contributes to Faith",
      "but on the other I think my Christian beliefs",
      "provide an overarching framework of understanding",
      "of trying to discern how Knowledge",
      "from different disciplines fit together.",
      "And what does it all mean?",
      "And I started reading the Bible and",
      "to my not wanting to tell anybody what was happening in me.",
      "I started to change it started to change me and",
      "I thought it would be sort of full of Fantastical crazy stuff.",
      "They actually had me start with Proverbs",
      "which was smart because it was full of so much wisdom that",
      "I'd read a few verses and I have to put it down",
      "and Ponder what was going on here and",
      "it immediately hit me with",
      " my you know,",
      "my sort of intellectual arrogance",
      "that I had a lot to learn from what was written here.",
      " After a period of consideration,",
      "I did reach the point of realizing that",
      "I kind of did believe this that Christianity made sense to me",
      "made intellectual sense to me and that I needed to",
      "if I were to be true to what I thought was reality",
      "and what I now think is reality that",
      "I needed to take a step of commitment",
      "and faith and and become a follower of Jesus",
      "and that and that's I did that and",
      "I was baptized as on my 20th.",
      " birthday actually in the chapel of King's College, Cambridge",
      " And I'm studying issues of culture and race in my work",
      "and you know, not quite audibly",
      "but audibly and understandably God just kind of said",
      "hey, you know, I'm bigger than your African-American Miss.",
      "I'm bigger than your racial background.",
      "In fact, I created racial and ethnic identity",
      "and different cultures.",
      "I created at your study at let me show it to you.",
      " For more information about the Veritas Forum",
      "including additional recordings and a calendar of upcoming events.",
      "Please visit our website at Veritas dot-org."
  ]
}
