{
  "trans": [
    "What is your answer to the absence of free will",
    "if God created every fiber of our being every atom every impulse Duty not also creates in",
    "did he not also create Satan and his actions?",
    "Let me go first and",
    "then Vince will give you the substance of it.",
    "I'll take a stab at that.",
    "If the question is to hold together every assumption that is in that",
    "what is the purpose of God doing that then? Of course,",
    "I'm assuming you also are",
    "wanting God to remain in the Paradigm",
    "and that he is the creator of the universe and your life and mine.",
    "When you know that an infinite perfect,",
    "God has created you and me.",
    "There are only four possibilities of God and",
    "creation. Number one that God would create nothing",
    "nothing at all.",
    "Number two where he would create a world where there was no such thing as good or evil,",
    "uh name or",
    "world number three where he would create a world where we",
    "Only choose good",
    "or number four",
    "create this world where there's the possibility of Good and",
    "Evil with the freedom given to us.",
    "No creation",
    "a moral world",
    "where we would only choose good or",
    "create a world like this where he has given us the freedom to choose good",
    "and evil,",
    "this is the only one of the four worlds in which Love Is Possible.",
    "If love is the Supreme ethic",
    "and love is the ethic towards rich on the longing towards which we all stryer.",
    "This is the only one of the four possibilities",
    "in which love is given to us as a legitimate possibility",
    "that me give you",
    "the illustration from a child and",
    "then move into some philosophical extensions of that.",
    "You know,",
    "when you are a parent",
    "you look at life very differently than before you raise your first child.",
    "Then when you are a grandparent you look at it even more differently",
    "than you did when you were a parent when you're a parent you are so preoccupied with the worries and the fears",
    "and that your time is given over",
    "to that stress dissonance",
    "when you've got grandkids the wonderful thing is somebody else does the worrying",
    "and you can just hug and hold and Say Goodbye at the end of the day",
    "and get your life back again and get your house back again.",
    "I don't know why a country musician is not yet written a song about this.",
    "Soon as they go you get your house back you get your toys back you get everything back.",
    "But I watched my grandkids",
    "GK Chesterton said he learned more from observing children than he ever did from going studying philosophy",
    "my three and",
    "a half year old grandson Jude who is now 6,",
    "he's a guy with an amazing vocabulary.",
    "I don't know where he gets it from but",
    "he's got it.",
    "He's the guy who dangles us feet at the table and",
    "looks across the table and",
    "says to you papa",
    "what he six now Surah he was about five and",
    "he looked at me and",
    "he said Papa.",
    "What is the meaning of sophomoric?",
    "Who's",
    "teaching this guy? Where is he getting all of this? Right?",
    "So nice three now is a wee little tyke sweet little boy precious little guy",
    "and his mother had lost her car keys,",
    "and she's looking all over the place and confounded.",
    "She pauses her daughter Naomi stops her forehead and says,",
    "I must be losing my mind.",
    "Jude comes and",
    "stands in front of her and",
    "said Mommy whatever you do,",
    "please don't ever lose your heart because I'm in there.",
    "Tell me.",
    "Where does he come up with something like that",
    "the longing to look at his mother and",
    "say to her don't ever lose your heart.",
    "I'm in there",
    "love is the craving of the human heart",
    "to belong in the sacredness of trust and a relationship",
    "and that is what you longed for. And I longed for",
    "God and giving us freedom gave us the greatest possible gift we could ever have with the Great.",
    "Possible vulnerability",
    "at the same time",
    "and once you know him",
    "and follow him and love him and enjoy his love",
    "you will realize that for the sake of love and",
    "for the sake of that relationship with you.",
    "He gives gives you that freedom",
    "and there are only two kinds of Destinies that you have",
    "you can bend your knee to God said serious Lewis",
    "and say to him your will be done",
    "or you refuse to bend that knee.",
    "Need to him and",
    "he says to you your will be done.",
    "If you really watched wish to enjoy the freedom",
    "of what this gift is all about for creativity and all",
    "then this is the world that gives you the possibility",
    "of love and",
    "the beauty of the sacredness of a relationship the more you get to know him",
    "the less you ask the other question because you know in his wisdom he has an explanation that",
    "In time and in eternity",
    "will be ultimately revealed that me give you one illustration and",
    "turn it over to Vince.",
    "You take your two year old to a doctor",
    "for an injection",
    "and the doctor is about to jab that needle and the two-year-old start screaming and sits at the back of the car. And on the way back says",
    "I don't understand my mother",
    "she brought me here",
    "for him to Jap this in my arm.",
    "Not only that I saw her paying him for doing that to me.",
    "And then comes a few years that go by and",
    "as a disease stalking the land",
    "and that little one has grown up and said if my mother hadn't done that",
    "I would be a victim for what exactly is blinking the country.",
    "Now",
    "time is a necessary component for understanding the big picture.",
    "I have no doubt. God gives us the big picture when we say",
    "I know get it. That is my brief. Answer to thank you.",
    "Well one way to understand this challenge is that God is all good and",
    "God only creates good things.",
    "So how is it that putting good things together if that's all that God creates could wind up with sin and evil.",
    "Let me just quickly give you",
    "a more trivial example,",
    "but one that I find helpful",
    "in understanding this and",
    "then a more serious illustration from my life",
    "the example that I find helpful is going to a buffet anyone like going to a buffet",
    "I really like going to a buffet but",
    "I am not a good Buffet eater",
    "because I go to the buffet and",
    "everything individually looks great.",
    "And I'm not able to process the fact that some of these things don't go well together.",
    "And so I put all of them on my plate",
    "and it doesn't go. Well then or",
    "for the rest of the night.",
    "That's how I think about this God only creates good things,",
    "right? He creates the power for me to move my arm.",
    "He creates the power for me to have free will",
    "they're both good things. I can use my arm to help someone up.",
    "But if I put those two things together in the wrong way,",
    "then it's not a good thing.",
    "And the more serious illustration in my life that makes me reflect deeper on this",
    "is of someone who has a child.",
    "I can remember as a teenager. I wasn't very kind to him and",
    "he wasn't very kind to me",
    "and I use those powers that God gave me to push him down rather than to help him up.",
    "And I remember taking every opportunity I could to put this guy down",
    "and then I learned a number of years ago that he had taken his life.",
    "And at one point the Bible says for the wages of sin is death and",
    "I had read that verse hundreds of times and",
    "it never really hit me until then and",
    "I had to start asking questions.",
    "Like would he have taken his life had I been kind to him had I use those very same powers of the movement of my arm and of the free will not to push him down but",
    "to help him up and I didn't know the answer to those questions. Sometimes I think we're too quick to look up and blame.",
    "God for the evil in the world and",
    "we're too slow",
    "to look to ourselves and turn that question around and ask.",
    "What is our part",
    "in that GK Chesterton was once asked to write into a newspaper with an answer to the question what's wrong with the world and",
    "he wrote a very short letter. He wrote dear sirs.",
    "I am sincerely yours GK Chesterton.",
    "And so sometimes I think we're too quick to look up and blame God",
    "ironically the same God who when he was hanging down.",
    "Across",
    "looked at the ones who are producing evil in his life and",
    "the instinctive words of his heart or father",
    "forgive them."
  ]
}
