{
  "trans": [
    "Isn't Christianity at its core the same as other religions, if you could put it in a pot and boil it down wouldn't the remainder smell look and taste the same as Judaism Islam Buddhism Hinduism. And the rest what is religion just as we refer to our minds is being thoughts and ideas beyond the electrical impulses of our physical brain, the major religions proposed that the humans true Essence is their soul instead of their physical body, but just like our physical bodies the soul also",
    " so has needs or it will starve each religion proposes to be a guidebook of that spiritual plane that helps lead are starving souls to sole bread aren't these guidebooks all the same the historical Jesus of Nazareth told a story about a father two sons and a family business. It was custom that the sons would split the business when their father died, but the younger son said to his father. I can't wait for you to die. Give me my money now seeing his sons True Heart the father gave it up to him the sun turned his back.",
    " His family and hit the road far away. He party like an animal eating and drinking and paying prostitutes until suddenly his pockets were empty in desperation. He found a job feeding pigs, but the country's economy crashed and he couldn't even make enough to feed himself now broke and starving. He found himself craving the pig slop when it suddenly hit him that there was probably food back home.",
    " What do you think should this father let him back into the house as long as the sun works hard to pay his father back. Then he should be able to get a place for the family table again. Right? Let's see how Jesus ended the story The Son decided to return admit his wrong and asked his father for a minimum wage job, but still a ways from home his father spotted him and ran out to him and wrapped him in a bear hug remorseful the sun began his plea dad. You shouldn't even call me your son anymore, but the",
    " Put a fine robe on him and a ring with a family crest. He told his workers get the best meat and prepare a welcome home Feast for this son of mine was dead and has come to life again. He was lost and has been found.",
    " Although Jesus told this as a story he was actually presenting his view of the truth in the story The Father represents God so is Jesus seriously teaching that God forgives selfish gluttons before they repaid their wrongs against him and others Judaism teaches that one can atone for their wrongs by changing their behavior praying and doing good deeds Islam says we can move towards Paradise by performing The Five Pillars.",
    " Hinduism claims that if we store up enough Good Karma will reunite with Brahman Buddhism says we can Enlighten and discipline ourselves into Nirvana by practicing the Eightfold Path. But in this story The Father embraced his son and fed him before he did any work why because in Jesus is view. It's impossible for a person to repay God for their bad Deeds. God is a perfect judge who cannot be bought off with anything that we have to offer. Jesus said that when we die",
    " We will face God with all of our Deeds laid out. None of us is completely morally perfect and none of us will stand a chance of justifying ourselves. Then is there hope for us Jesus believe so and staked his life on it. He claimed to be God in human form who came to pay our moral debt with his innocent life so that if anyone truly believed and surrendered to him, they would receive a full pardon from God and the power to change how they live other religions teach that our own self sacrifice can pay our",
    " Our debt but Jesus taught that only God's own self sacrifice can pay our debt. All other religious Founders claim to be guides to lead are starving souls to bread. Jesus claimed to be the bread our soul star for"
  ]
}
