{
  "trans": [
    "Appreciate that question and",
    "it's a question that",
    "has the assumption that",
    "is very correct",
    "often times.",
    "The Christian takes the hit",
    "that he or she was a follower of Jesus Christ is the only one who lays claim to exclusivity that",
    "is not true.",
    "Got them a Buddha was born a Hindu",
    "and here announced two of the fundamental doctrines of Hinduism",
    "the authority of The Vedas",
    "and the caste system.",
    "He could not accept those two",
    "went on his own journey in search of Enlightenment and",
    "came off course with the",
    "Four noble truths and",
    "the Eightfold Path",
    "and the ultimate extinguishing of desire",
    "in this nirvanic Pursuit.",
    "So he turned his",
    "belief away from the religion of his birth in order to find a different answer",
    "Islam is also exclusive aesthetic in its claim",
    "in all of its precepts and it's five pillars and so on.",
    "What about these contradistinction 's",
    "The first thing we need to know is",
    "there are distinctions.",
    "There are fundamental differences at best.",
    "There are superficial similarities.",
    "I often hear the question posed wrongly",
    "they'll say are all really aren't all religions fundamentally the same and",
    "superficially different know",
    "they are fundamentally different and",
    "at best they are superficially similar.",
    "What are the fundamental claims for example in Buddhism.",
    "The goal is to escape extinguish.",
    "GE extinguish desire.",
    "I remember talking to the first woman monk",
    "who is from Thailand to be ordained into the Buddhist.",
    "Priest Hood,",
    "but Thai Buddhist do not ordain",
    "women. So she went to Sri Lanka",
    "to be ordained and",
    "she has a PHD in Philosophy from McMaster University in Hamilton,",
    "Ontario and",
    "Waterloo, I guess Ontario and",
    "McMaster devere University there",
    "got her PhD in philosophy and",
    "she gave me the first",
    "View we chatted for well over an hour one on one",
    "and I sort of angled into some questions because",
    "I didn't want to be too discourteous.",
    "And one of the things I said to her is I hear you're married and",
    "she said yes",
    "I said you have children.",
    "She said yes",
    "I said but you're living in a temple by yourself.",
    "She said yes.",
    "I said you not see your children.",
    "She started crying.",
    "She said I have a car",
    "I said you have a car she said yeah,",
    "she said okay,",
    "so she",
    "drove herself because she can't allow a man to drive her.",
    "She said so she has to drive herself",
    "and she says every evening at the end of the day.",
    "I try and meet up with one of my children.",
    "She said this is the hardest part of my life",
    "I said so you are on the journey to extinguishing the desire to be with your children.",
    "Is that right? Is that a fair assessment?",
    "She kept quiet.",
    "And then I said this I said the Dalai Lama",
    "has as as primary Pursuit now",
    "the freedom of Tibet she said that's right.",
    "I said,",
    "why does he desire that?",
    "She looked at me and",
    "she said we try not to get into these philosophical questions.",
    "Let's just say that",
    "he chooses to",
    "you take a look at other world religions",
    "and see where these four questions are dealt with origin meaning morality and Destiny.",
    "These four questions have to be answered in two ways.",
    "Follow me, please",
    "every particular answer has to correspond to truth",
    "either through empirical form of measurement or",
    "through the logical reasoning process",
    "and windows for answers are put together.",
    "They must go here.",
    "And not be incoherent so the to test correspondence and coherence.",
    "I guarantee you only in the judeo-christian worldview.",
    "Will you find these four questions answered with corresponding truthfulness",
    "and with the coherence of a world view? Let me take just one example,",
    "and I don't say this to slight but",
    "this is a fact and",
    "we have to deal with it.",
    "I've been invited in many many Islamic countries and",
    "I have open forums there and",
    "going to go to one of the toughest Islamic countries with the next few weeks.",
    "They've hosted me in many parts there and",
    "we've had dialogues.",
    "I want to give to you two things.",
    "in the Quran",
    "it is the only historical Lee claimed document",
    "that denies that Jesus Christ was actually crucified or",
    "died on the cross denies that",
    "the Greek historians say he died on the cross Roman historians.",
    "Say that",
    "Pagan historians say that Jewish historians say that and",
    "Christian historians say that",
    "the Islamic",
    "the the Quran is the only one that says it appeared to him that he died,",
    "but he didn't actually die on the cross.",
    "So historically it is making a formation",
    "that is really historically untrue.",
    "I got into a discussion with Sheikh Hussein of the leading.",
    "Shiite cleric in Damascus Syria as a real gentleman",
    "for over three hours.",
    "We talked with an interpreter between us",
    "and an audience listening and",
    "I was allowed to ask him one question about his faith and",
    "he was allowed to ask me one question.",
    "But mine",
    "there was nothing no Rancor no adversarial stance just a perspective encounter perspective and back and forth",
    "It's the best way to do it really",
    "at the end of it Sheikh husam looked at me was very respectful to the whole time always refer to me as professor.",
    "Zachary has Professor Zacharias",
    "and then at the end he looked at me leaned over and he said,",
    "you know professor.",
    "I think the time has come",
    "for us in the Islamic world to stop asking if Jesus Christ died and",
    "to start asking why.",
    "I said to him.",
    "May I quote you on that sir?",
    "He said yes,",
    "you may I'm am hopefully going to go there before long and",
    "I hope we can meet up again",
    "origin meaning morality and Destiny",
    "the judeo Christian worldview is not the only one that claims exclusivity",
    "but is the only one that takes those four questions with corresponding answers that are truthful",
    "and coherent answers that",
    "stand the test of time",
    "and the ultimate answer of the Resurrection from the dead",
    "that gives you hope and",
    "meaning I see we have one more",
    "more question left and",
    "that's the sign here.",
    "I'll be happy to take that."
  ]
}
