{"trans": [
    "Evolution you learned about it in high school.",
    "It goes like this life started out",
    "with very simple forms and then",
    "gradually over hundreds of millions of years",
    "morphed into all the forms.",
    "We see today bacteria to Beethoven not a straight line,",
    "of course, but that's roughly how it went.",
    "This was the theory proposed by Charles Darwin in 1859",
    "and with some modification.",
    "It's been embraced as unassailable",
    "by the scientific community over the last century.",
    "As evolutionary biologist Richard Dawkins says",
    "if you meet somebody",
    "who claims not to believe in evolution",
    "that person is either ignorant stupid or insane.",
    "But is that right",
    "are there no, scientific reasons to doubt",
    "The evolutionary count of life's origins in November 2016.",
    "I attended a conference in London convened",
    "by some of the world's leading evolutionary biologists",
    "the purpose to address growing doubts about",
    "the modern version of Darwin's theory.",
    "Let's look at just two scientific reasons to doubt this Theory",
    "first the Cambrian explosion a weird",
    "and wonderful thing happened 530 million years ago a whole",
    "each of major groups of animals",
    "what scientists call the phyla",
    "appeared abruptly within a geologically short window of time",
    "about 10 million years",
    "these novel animal forms exhibiting",
    "prototypes of most animal body designs.",
    "We see today emerged in the fossil record",
    "without evidence of earlier ancestors.",
    "Did you catch that",
    "a huge number of diverse animals",
    "appeared with no discernible antecedents?",
    "So where do they come from",
    "this question really bothered Darwin",
    "and he acknowledged that",
    "he could give it no satisfactory answer",
    "nor can scientists today.",
    "The renowned biologist Eugene. Koonin",
    "of the national Center for biotechnology information",
    "describes the abrupt appearance of the Cambrian animals",
    "and other organisms such as dinosaurs birds flowering plants and mammals",
    "as a pattern of biological Big Bangs.",
    "So what caused all these new forms of life to arise",
    "That question leads to a second big doubt",
    "the DNA Enigma in the 1950s James Watson and Francis Crick",
    "made a startling Discovery the DNA molecule stores information",
    "as a four-character digital code strings",
    "of precisely sequence chemicals",
    "inside the DNA Helix store,",
    "the instructions the information for building the crucial proteins",
    "that cells need to survive",
    "unless the chemical letters in the DNA texts are sequenced properly.",
    "A protein molecule will not form no proteins.",
    "No cells. No cells. No living organisms.",
    "Bill Gates has said DNA is like a software program.",
    "Let's think about that for a second",
    "for computers to run faster and perform more functions.",
    "They require new code.",
    "Well, the same is true for life to build new forms of life.",
    "The evolutionary process would need to",
    "produce new genetic information new code.",
    "But this raises questions about the creative power",
    "of natural selection of mutation",
    "natural selection is a simple sorting process",
    "species keep favorable mutations that allow them to survive.",
    "I've but eliminate bad mutations that cause their members to die out.",
    "No one doubts that natural selection is a real process",
    "and that it produces minor variations,",
    "but many biologists now doubt that it produces major Innovations in biological form",
    "to see why I think again about software",
    "what happens if you introduce a few random changes into computer code,",
    "you'll likely mess it up right though.",
    "It might still work if you don't make too many changes,",
    "but if you make enough random changes your program",
    "will stop functioning all together.",
    "You certainly can't keep doing this and expect some cool new program to pop out.",
    "There's a mathematical reason for this in all codes and languages.",
    "There are vastly more ways of arranging characters that will generate gibberish.",
    "Then there are Arrangements that will generate meaningful sequences",
    "and this applies to DNA remember natural selection",
    "only selects sequences that random mutations generate.",
    "Yet experiments have established that",
    "DNA sequences capable of making stable proteins are extremely rare",
    "and thus really hard to stumble on randomly.",
    "How rare",
    "while working at Cambridge University molecular biologist Douglas acts show that",
    "for every DNA sequence that generates a relatively short functional protein.",
    "There are 10 to the 77th power non functional sequences.",
    "Now consider that there are only 10 to the 65th power atoms in our galaxy.",
    "So finding a new DNA sequence capable of building a functional protein",
    "is like searching blindfolded for a single marked Adam among a trillion Milky Way galaxies",
    "talk about a needle in a haystack",
    "as I show in my book Darwin's doubt,",
    "even four billion years of life's history is not enough time",
    "to overcome a search problem this big",
    "so to Serious doubts about modern darwinian.",
    "The Cambrian explosion the sudden appearance of new animals",
    "which evolutionary theory has failed to explain",
    "and the DNA Enigma the impossibility of random mutations",
    "producing the information needed to build new forms of animal life",
    "scientists who know about these problems are not ignorant stupid or insane.",
    "They are just appropriately skeptical.",
    "I'm Steven Mayer senior fellow at The Discovery Institute for Prager University.",
    "Thank you for watching this video to help keep Prager you videos free.",
    "Please consider making a tax-deductible donation."
    ]
}
