{
  "trans": [
    "I got my PhD in the field of organic chemistry postdoc at Stanford University joined the group of a man who is going to win a Nobel Prize in chemistry voted one of the top 50 most influential Minds in the world. I was a visiting scholar at Harvard University. I've spoken it every major university in this country have over 650 research Publications voted the Rd magazine scientist of the year. I'm in the National",
    " enemy of inventors. I'm a member of the American Association for the advancement of science over a hundred and twenty patents started seven or eight companies. We work in areas that range from medicine to Material Science to electronics computer memory medical devices. We work across a broad range of areas, but more than any effect.",
    " What means the most to me is that I'm a Jew who believes that Jesus is the Messiah I grew up just outside of New York City. I thought everybody was Jewish. I didn't even know that there was anything else I had no particular interest in that other than when all my friends were getting bar mitzvahed or bat mitzvah and then I would attend of course every week there was never really any excitement for me.",
    " Remember once I even tried to talk to a rabbi. He just brushed me off. It was very little explanation for me.",
    " I remember when I went to college I started meeting a number of people that said that they were born again Christians, which was sort of an odd term. I was what born again. What do you mean born again? One person saw me in the laundry room if he said do you mind if I give you an illustration of the gospel? And I remember we sat there and he actually started to draw a picture a cliff with a",
    " With a man on one side and he drew a little man and then another Cliff with God on the other side and a big chasm in between that he labeled. It's in and looked at him I said, I'm not a sinner. I've never killed anyone. I never robbed the bank. How could I be a sinner and he had me read a verse from the Bible for all have sinned and fall short of the glory of God in modern Judaism. We never really talked about Sin. I don't remember ever talking about",
    " In in my home, so he turned to another passage. Jesus said I say to you that everyone who looks upon a woman with Lust For Her has already committed adultery with her in his heart.",
    " Pop I felt just as if I'd been punched right in the chest pure. I was new in college. I didn't think anybody knew I would pick up these magazines and I became addicted to pornography who's just through those magazines and all of a sudden something that's written in the Bible. Somebody from lived who lived 2000 years ago is calling me out on it.",
    " And I felt immediately convicted and that now I realized I was a sinner.",
    " When I read in the scriptures, what sin is then? I knew I was a sinner. How am I going to get to God? We Jews know this better than anyone else without the shedding of blood. There is no forgiveness of sin this description in Isaiah 53 of how he will bear upon himself mice in the things that I had done. And this was him. This was the man",
    " Took this upon himself on the cross.",
    " The perfect God comes and gives himself for us. He is the one that gives himself for us started to realize how Jewish the New Testament is. This book is so Jewish. The New Testament is so Jewish. It's all around Jewish people and then on November 7 1977. I was all alone in my room the realization.",
    " That Yeshua is the one who died on the cross and I said Lord, I am a sinner. Please forgive me come into my life and then all of a sudden someone was in my room.",
    " And I opened my eyes. I was on my knees. I opened my eyes. I was in my room that man Jesus Christ stood in my room. This amazing sense of God. Jesus was in my room and I wasn't scared. All I started doing was just weeping. The presence was So Glorious because he was there in my room on that day.",
    " And I didn't want to get up and this amazing sense of forgiveness just started to come upon me. There was a family I got up. I didn't know what to do.",
    " I didn't know who to tell yours is Jewish kid from New York City, but I'm going to say my cousins were shocked. How could you do that? You're Jewish telling my mother how I had invited Jesus into my life. She didn't say much. She was weeping. She told my father they weren't happy at all. And she said I don't blame them for Killing Jesus after the things that he said, who is he to come against these religious leaders?",
    " That have dedicated their lives to helping people and to tell them that there are whitewashed tombs. Who is he this young man in his 30s to say this to these Scholars?",
    " He got what he deserved and my mother's a very deep pensive careful reader. She read from Genesis right on through the Tanakh the whole thing when she got done. I said, what did you think? She said God warned us over and over again?",
    " He warned us when my daughter was about 15 my mother and father came to visit us.",
    " At one point, my mother went into her room for several hours. She came out. She said the quite a young girl you have she talked to me for a long time. She started reading the Bible again both the Old and the New Testament one day not long after that. She called me on the phone at the age of 72. She said Jimmy you wouldn't believe what happened. This is what happened.",
    " She said I was just reading and it hit me.",
    " It hit me the way he gave his life. I believe it now Jesus is the son of God."
  ]
}
