{
    "trans" : [
	"the question represents",
	"a complete misunderstanding",
	"of the Christian doctrine of the Resurrection because",
	"It is first of all",
	"Central to Christian. Hope",
	"because the resurrection is a solution",
	"to the problem that faces all of us that is death.",
	"You see some religions",
	"like the ones we've been talking about",
	"in the end Ultimate Reality is impersonal.",
	"The individual person is lost",
	"in the void. So to speak",
	"now Christianity.",
	"chose something very different",
	"teachers that human life",
	"human beings are of infinite value and",
	"The Christian hope says that",
	"death and covid-19 will eventually",
	"be overcome not buy medicines and play",
	"but the fact is that",
	"what Christ offers to people",
	"if they repent and trust him is that",
	"one day they will be raised bodily from the dead.",
	"This is not a relic of a shamanistic worldview.",
	"the focus on the afterlife is a very practical thing",
	"and if it is understood in a Christian way,",
	"it does not lead to the neglect of the world here",
	"and now it leads to the exact opposite",
	"and one of the longest explanations of",
	"the significance of the resurrection of the body",
	"the Apostle Paul in 1 Corinthians 15",
	"points out that our work in",
	"This world is not in vain.",
	"Why",
	"because there's going to be a resurrection",
	"in other words you think of anyone yourself",
	"you needed something to live for.",
	"We cannot live for the present",
	"we can live in the present.",
	"We have to live in the present,",
	"but we can't live for the present.",
	"So we have to ask what future do we live for",
	"and people say well I live for the hope",
	"that I will have a family or a house or a better job and so on.",
	"Well, what's that for and ultimately",
	"we come to the question of death.",
	"And what is there now to live for",
	"you see?",
	"From being a relic of a shamanistic worldview",
	"Christianity is totally practical",
	"because it gives us a big goal",
	"and not simply a series of short-term goals",
	"that fill our Horizons to such an extent",
	"we never asked where the whole thing is going",
	"and we are told that we Are Made For Eternity.",
	"This is a huge big story and our life can fit into it",
	"and this to my mind is one of the most",
	"Exciting things",
	"and therefore I want to put all I can into this world.",
	"And if I were a doctor",
	"I would hope I'd be fighting covid-19 not retiring from this world",
	"because there's going to be another one",
	"but it would seem that the way in which",
	"we invest life in this world",
	"the way in which we live does affect the world to come",
	"but the interesting thing is that",
	"of course would",
	"ISM believes that but it believes in reincarnation.",
	"I don't think there is any reincarnation.",
	"There's no need for it because",
	"once a person receives eternal life",
	"that is eternal and they will be raised from the dead by Christ",
	"and any Christian who lives neglecting the world here and now",
	"there's a very big question as to whether they're a Christian or not.",
	"Because if you look at Jesus teaching to his disciples",
	"and the way in which they are to behave in this world",
	"because of the larger world to come you will see that",
	"they do not neglect the world.",
	"Just think of it here are doctors fighting covet and nurses",
	"where did nursing come from",
	"where did hospitals come from?",
	"Where did Hospice has come from? They are all",
	"inevitably and originally Christian institutions",
	"so that there is a hugely good track record",
	"certainly here in the west of Christianity",
	"as being very caring",
	"and I would challenge anybody that",
	"if they say that they're neglecting this world",
	"because there's a world to come",
	"I would seriously question",
	"as to whether they've begun to understand Christianity."
    ]
}
